Revit 2026 API

# MetalMetalPerforationsSize Property

---

The property labeled "Diameter/Size" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetalPerforationsSize { get; }
```
```vb
Public Shared ReadOnly Property MetalPerforationsSize As String
	Get
```
```cpp
public:
static property String^ MetalPerforationsSize {
	String^ get ();
}
```
```fsharp
static member MetalPerforationsSize : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" with a minimum of "0.0001".

#### Reference

Metal Class

Autodesk.Revit.DB.Visual Namespace